espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf52.xml
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf52</name>
  <series>nrf52</series>
  <version>1</version>
  <description>nRF52 reference description for radio MCU with ARM 32-bit Cortex-M4 Microcontroller </description>
  <licenseText>
            Copyright (c) 2015, Nordic Semiconductor ASA\n
            All rights reserved.\n
            \n
            Redistribution and use in source and binary forms, with or without\n
            modification, are permitted provided that the following conditions are met:\n
            \n
            * Redistributions of source code must retain the above copyright notice, this\n
              list of conditions and the following disclaimer.\n
            \n
            * Redistributions in binary form must reproduce the above copyright notice,\n
              this list of conditions and the following disclaimer in the documentation\n
              and/or other materials provided with the distribution.\n
            \n
            * Neither the name of Nordic Semiconductor ASA nor the names of its\n
              contributors may be used to endorse or promote products derived from\n
              this software without specific prior written permission.\n
            \n
            THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"\n
            AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n
            IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n
            DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\n
            FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n
            DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n
            SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n
            CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\n
            OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n
            OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n
        </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <cpu>
    <name>CM4</name>
    <revision>r0p1</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
  </cpu>
  <headerSystemFilename>system_nrf52</headerSystemFilename>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <vendorExtensions>
    <ExampleStackSize>2048</ExampleStackSize>
    <ExampleHeapSize>2048</ExampleHeapSize>
    <MaxInterrupts>240</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>FICR</name>
      <description>Factory Information Configuration Registers</description>
      <groupName>FICR</groupName>
      <baseAddress>0x10000000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CODEPAGESIZE</name>
          <description>Code memory page size</description>
          <addressOffset>0x010</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CODEPAGESIZE</name>
              <description>Code memory page size</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CODESIZE</name>
          <description>Code memory size</description>
          <addressOffset>0x014</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CODESIZE</name>
              <description>Code memory size in number of pages</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIGID</name>
          <description>Configuration identifier</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>HWID</name>
              <description>Identification number for the HW</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>FWID</name>
              <description>Deprecated field -  Identification number for the FW that is pre-loaded into the chip</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>DEVICEID[%s]</name>
          <description>Description collection[0]:  Device identifier</description>
          <addressOffset>0x060</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEID</name>
              <description>64 bit unique device identifier</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>ER[%s]</name>
          <description>Description collection[0]:  Encryption Root, word 0</description>
          <addressOffset>0x080</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>ER</name>
              <description>Encryption Root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>IR[%s]</name>
          <description>Description collection[0]:  Identity Root, word 0</description>
          <addressOffset>0x090</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>IR</name>
              <description>Identity Root, word n</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVICEADDRTYPE</name>
          <description>Device address type</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEADDRTYPE</name>
              <description>Device address type</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Public</name>
                  <description>Public address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Random</name>
                  <description>Random address</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>DEVICEADDR[%s]</name>
          <description>Description collection[0]:  Device address 0</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DEVICEADDR</name>
              <description>48 bit device address</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00052000</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>N51822</name>
                    <description>nRF51822</description>
                    <value>0x51822</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>N51422</name>
                    <description>nRF51422</description>
                    <value>0x51422</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>N52000</name>
                    <description>nRF52000</description>
                    <value>0x52000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part variant</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>nRF51C</name>
                    <description>nRF51-C</description>
                    <value>0x1002</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>nRF51D</name>
                    <description>nRF51-D</description>
                    <value>0x1003</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>nRF51E</name>
                    <description>nRF51-E</description>
                    <value>0x1004</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>QFN48</name>
                    <description>48-pin QFN with 31 GPIO</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>nRF51CSP56A</name>
                    <description>nRF51x22 CDxx - WLCSP 56 balls</description>
                    <value>0x1000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>nRF51CSP62A</name>
                    <description>nRF51x22 CExx - WLCSP 62 balls</description>
                    <value>0x1001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>nRF51CSP62B</name>
                    <description>nRF51x22 CFxx - WLCSP 62 balls</description>
                    <value>0x1002</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>nRF51CSP62C</name>
                    <description>nRF51x22 CTxx - WLCSP 62 balls</description>
                    <value>0x1003</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000040</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K16</name>
                    <description>16 kByte RAM</description>
                    <value>16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K32</name>
                    <description>32 kByte RAM</description>
                    <value>32</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K64</name>
                    <description>64 kByte RAM</description>
                    <value>64</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH</name>
            <description>Flash variant</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000200</resetValue>
            <fields>
              <field>
                <name>FLASH</name>
                <description>Flash variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K128</name>
                    <description>128 kByte FLASH</description>
                    <value>128</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K256</name>
                    <description>256 kByte FLASH</description>
                    <value>256</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>K512</name>
                    <description>512 kByte FLASH</description>
                    <value>512</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>3</dim>
            <dimIncrement>4</dimIncrement>
            <dimIndex>0-2</dimIndex>
            <name>UNUSED0[%s]</name>
            <description>Description collection[0]: Unspecified</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <cluster>
          <name>NFC</name>
          <description>Unspecified</description>
          <headerStructName>FICR_NFC</headerStructName>
          <addressOffset>0x450</addressOffset>
          <register>
            <name>TAGHEADER0</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFF5F</resetValue>
            <fields>
              <field>
                <name>MFGID</name>
                <description>Default Manufacturer ID: Nordic Semiconductor ASA has ICM 0x5F</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD1</name>
                <description>Unique identifier byte 1</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD2</name>
                <description>Unique identifier byte 2</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD3</name>
                <description>Unique identifier byte 3</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER1</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD4</name>
                <description>Unique identifier byte 4</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD5</name>
                <description>Unique identifier byte 5</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD6</name>
                <description>Unique identifier byte 6</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD7</name>
                <description>Unique identifier byte 7</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER2</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD8</name>
                <description>Unique identifier byte 8</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD9</name>
                <description>Unique identifier byte 9</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD10</name>
                <description>Unique identifier byte 10</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD11</name>
                <description>Unique identifier byte 11</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TAGHEADER3</name>
            <description>Default header for NFC Tag. Software can read these values to populate NFCID1_3RD_LAST, NFCID1_2ND_LAST and NFCID1_LAST.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>UD12</name>
                <description>Unique identifier byte 12</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>UD13</name>
                <description>Unique identifier byte 13</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>UD14</name>
                <description>Unique identifier byte 14</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>UD15</name>
                <description>Unique identifier byte 15</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
