espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf52.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>UICR</name>
      <description>User Information Configuration Registers</description>
      <groupName>UICR</groupName>
      <baseAddress>0x10001000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UNUSED0</name>
          <description>Unspecified</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>UNUSED1</name>
          <description>Unspecified</description>
          <addressOffset>0x004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>UNUSED2</name>
          <description>Unspecified</description>
          <addressOffset>0x008</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>UNUSED3</name>
          <description>Unspecified</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <dim>15</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-14</dimIndex>
          <name>NRFFW[%s]</name>
          <description>Description collection[0]:  Reserved for Nordic firmware design</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NRFFW</name>
              <description>Reserved for Nordic firmware design</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-11</dimIndex>
          <name>NRFHW[%s]</name>
          <description>Description collection[0]:  Reserved for Nordic hardware design</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>NRFHW</name>
              <description>Reserved for Nordic hardware design</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-31</dimIndex>
          <name>CUSTOMER[%s]</name>
          <description>Description collection[0]:  Reserved for customer</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>CUSTOMER</name>
              <description>Reserved for customer</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-1</dimIndex>
          <name>PSELRESET[%s]</name>
          <description>Description collection[0]:  Mapping of the nRESET function (see POWER chapter for details)</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PIN</name>
              <description>GPIO number P0.n onto which Reset is exposed</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CONNECT</name>
              <description>Connection</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Disconnect</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Connect</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APPROTECT</name>
          <description>Access port protection</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks debugger read/write access to all CPU registers and memory mapped addresses except for the Control Access Port registers.</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0xFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x00</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NFCPINS</name>
          <description>Setting of pins dedicated to NFC functionality: NFC antenna or GPIO</description>
          <addressOffset>0x20C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PROTECT</name>
              <description>Setting of pins dedicated to NFC functionality</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Operation as GPIO pins. Same protection as normal GPIO pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NFC</name>
                  <description>Operation as NFC antenna pins. Configures the protection for NFC operation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
