espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf52.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="PWM0">
      <name>PWM1</name>
      <description>Pulse Width Modulation Unit 1</description>
      <groupName>PWM</groupName>
      <baseAddress>0x40021000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>PWM1</name>
        <value>33</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PWM0">
      <name>PWM2</name>
      <description>Pulse Width Modulation Unit 2</description>
      <groupName>PWM</groupName>
      <baseAddress>0x40022000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>PWM2</name>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIM0">
      <name>SPIM2</name>
      <description>Serial Peripheral Interface Master with EasyDMA 2</description>
      <groupName>SPIM</groupName>
      <baseAddress>0x40023000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>SPIM2_SPIS2_SPI2</name>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPIS0">
      <name>SPIS2</name>
      <description>SPI Slave 2</description>
      <groupName>SPIS</groupName>
      <baseAddress>0x40023000</baseAddress>
      <size>32</size>
      <alternatePeripheral>SPIM2</alternatePeripheral>
      <interrupt>
        <name>SPIM2_SPIS2_SPI2</name>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SPI0">
      <name>SPI2</name>
      <description>Serial Peripheral Interface 2</description>
      <groupName>SPI</groupName>
      <baseAddress>0x40023000</baseAddress>
      <size>32</size>
      <alternatePeripheral>SPIM2</alternatePeripheral>
      <interrupt>
        <name>SPIM2_SPIS2_SPI2</name>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="RTC0">
      <name>RTC2</name>
      <description>Real time counter 2</description>
      <groupName>RTC</groupName>
      <baseAddress>0x40024000</baseAddress>
      <size>32</size>
      <interrupt>
        <name>RTC2</name>
        <value>36</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>I2S</name>
      <description>Inter-IC Sound</description>
      <groupName>I2S</groupName>
      <baseAddress>0x40025000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2S</name>
        <value>37</value>
      </interrupt>
      <registers>
        <register>
          <name>TASKS_START</name>
          <description>Starts continuous I&lt;sup&gt;2&lt;/sup&gt;S transfer. Also starts MCK generator when this is enabled.</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stops I&lt;sup&gt;2&lt;/sup&gt;S transfer. Also stops MCK generator. Triggering this task will cause the STOPPED event to be generated.</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
        </register>
        <register>
          <name>EVENTS_RXPTRUPD</name>
          <description>The RXD.PTR register has been copied to internal double-buffers. When the I2S module is started and RX is enabled, this event will be generated for every RXTXD.MAXCNT words that are received on the SDIN pin.</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_STOPPED</name>
          <description>I&lt;sup&gt;2&lt;/sup&gt;S transfer stopped.</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>EVENTS_TXPTRUPD</name>
          <description>The TDX.PTR register has been copied to internal double-buffers. When the I2S module is started and TX is enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin.</description>
          <addressOffset>0x114</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXPTRUPD</name>
              <description>Enable or disable interrupt on EVENTS_RXPTRUPD event</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Enable or disable interrupt on EVENTS_STOPPED event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPTRUPD</name>
              <description>Enable or disable interrupt on EVENTS_TXPTRUPD event</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXPTRUPD</name>
              <description>Write '1' to Enable interrupt on EVENTS_RXPTRUPD event</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Write '1' to Enable interrupt on EVENTS_STOPPED event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPTRUPD</name>
              <description>Write '1' to Enable interrupt on EVENTS_TXPTRUPD event</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Disable interrupt</description>
          <addressOffset>0x308</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXPTRUPD</name>
              <description>Write '1' to Clear interrupt on EVENTS_RXPTRUPD event</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPPED</name>
              <description>Write '1' to Clear interrupt on EVENTS_STOPPED event</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPTRUPD</name>
              <description>Write '1' to Clear interrupt on EVENTS_TXPTRUPD event</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Disable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENABLE</name>
          <description>Enable I&lt;sup&gt;2&lt;/sup&gt;S module.</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable I&lt;sup&gt;2&lt;/sup&gt;S module.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disabl</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CONFIG</name>
          <description>Unspecified</description>
          <headerStructName>I2S_CONFIG</headerStructName>
          <addressOffset>0x504</addressOffset>
          <register>
            <name>MODE</name>
            <description>I&lt;sup&gt;2&lt;/sup&gt;S mode.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MODE</name>
                <description>I&lt;sup&gt;2&lt;/sup&gt;S mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MASTER</name>
                    <description>Master mode. SCK and LRCK generated from internal master clcok (MCK) and output on pins defined by PSEL.xxx.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SLAVE</name>
                    <description>Slave mode. SCK and LRCK generated by external master and received on pins defined by PSEL.xxx</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RXEN</name>
            <description>Reception (RX) enable.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXEN</name>
                <description>Reception (RX) enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Reception disabled and now data will be written to the RXD.PTR address.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Reception enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXEN</name>
            <description>Transmission (TX) enable.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>TXEN</name>
                <description>Transmission (TX) enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Transmission disabled and now data will be read from the RXD.TXD address.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Transmission enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCKEN</name>
            <description>Master clock generator enable.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>MCKEN</name>
                <description>Master clock generator enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLE</name>
                    <description>Master clock generator disabled and PSEL.MCK not connected(available as GPIO).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLE</name>
                    <description>Master clock generator running and MCK output on PSEL.MCK.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCKFREQ</name>
            <description>Master clock generator frequency.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x20000000</resetValue>
            <fields>
              <field>
                <name>MCKFREQ</name>
                <description>Master clock generator frequency.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32MDIV2</name>
                    <description>32 MHz / 2 = 16.0 MHz</description>
                    <value>0x80000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV3</name>
                    <description>32 MHz / 3 = 10.6666667 MHz</description>
                    <value>0x50000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV4</name>
                    <description>32 MHz / 4 = 8.0 MHz</description>
                    <value>0x40000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV5</name>
                    <description>32 MHz / 5 = 6.4 MHz</description>
                    <value>0x30000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV6</name>
                    <description>32 MHz / 6 = 5.3333333 MHz</description>
                    <value>0x28000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV8</name>
                    <description>32 MHz / 8 = 4.0 MHz</description>
                    <value>0x20000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV10</name>
                    <description>32 MHz / 10 = 3.2 MHz</description>
                    <value>0x18000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV11</name>
                    <description>32 MHz / 11 = 2.9090909 MHz</description>
                    <value>0x16000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV15</name>
                    <description>32 MHz / 15 = 2.1333333 MHz</description>
                    <value>0x11000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV16</name>
                    <description>32 MHz / 16 = 2.0 MHz</description>
                    <value>0x10000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV21</name>
                    <description>32 MHz / 21 = 1.5238095</description>
                    <value>0x0C000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV23</name>
                    <description>32 MHz / 23 = 1.3913043 MHz</description>
                    <value>0x0B000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV31</name>
                    <description>32 MHz / 31 = 1.0322581 MHz</description>
                    <value>0x08200000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV42</name>
                    <description>32 MHz / 42 = 0.7619048 MHz</description>
                    <value>0x06000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV63</name>
                    <description>32 MHz / 63 = 0.5079365 MHz</description>
                    <value>0x04100000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV125</name>
                    <description>32 MHz / 125 = 0.256 MHz</description>
                    <value>0x020C0000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
