espruino/Espruino/targetlibs/nrf5x/nrf52_sdk/SVD/nrf52.xml
          <register>
            <name>RATIO</name>
            <description>MCK / LRCK ratio.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000006</resetValue>
            <fields>
              <field>
                <name>RATIO</name>
                <description>MCK / LRCK ratio.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32X</name>
                    <description>LRCK = MCK / 32</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>48X</name>
                    <description>LRCK = MCK / 48</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64X</name>
                    <description>LRCK = MCK / 64</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>96X</name>
                    <description>LRCK = MCK / 96x</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128X</name>
                    <description>LRCK = MCK / 128</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>192X</name>
                    <description>LRCK = MCK / 192</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256X</name>
                    <description>LRCK = MCK / 256</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>384X</name>
                    <description>LRCK = MCK / 384</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512X</name>
                    <description>LRCK = MCK / 512</description>
                    <value>8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SWIDTH</name>
            <description>Sample width.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>SWIDTH</name>
                <description>Sample width.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8BIT</name>
                    <description>8 bit.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16BIT</name>
                    <description>16 bit.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>24BIT</name>
                    <description>24 bit.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ALIGN</name>
            <description>Alignment of sample within a frame.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ALIGN</name>
                <description>Alignment of sample within a frame.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LEFT</name>
                    <description>Left-aligned.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RIGHT</name>
                    <description>Right-aligned.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORMAT</name>
            <description>Frame format.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FORMAT</name>
                <description>Frame format.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>I2S</name>
                    <description>Original I&lt;sup&gt;2&lt;/sup&gt;S format.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DSP</name>
                    <description>Alternate (DSP) format.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CHANNELS</name>
            <description>Enable channels.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CHANNELS</name>
                <description>Enable channels.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>STEREO</name>
                    <description>Stereo.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LEFT</name>
                    <description>Left only.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RIGHT</name>
                    <description>Right only.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_RXD</headerStructName>
          <addressOffset>0x538</addressOffset>
          <register>
            <name>PTR</name>
            <description>Receive buffer RAM start address.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Receive buffer Data RAM start address. When receiving, words containing samples will be written to this address. This address is a word aligned Data RAM address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_TXD</headerStructName>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>PTR</name>
            <description>Transmit buffer RAM start address.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Transmit buffer Data RAM start address. When transmitting, words containing samples will be fetched from this address. This address is a word aligned Data RAM address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXTXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_RXTXD</headerStructName>
          <addressOffset>0x550</addressOffset>
          <register>
            <name>MAXCNT</name>
            <description>Size of RXD and TXD buffers.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Size of RXD and TXD buffers in number of 32 bit words.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>I2S_PSEL</headerStructName>
          <addressOffset>0x560</addressOffset>
          <register>
            <name>MCK</name>
            <description>Pin select for MCK signal.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SCK</name>
            <description>Pin select for SCK signal.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LRCK</name>
            <description>Pin select for LRCK signal.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDIN</name>
            <description>Pin select for SDIN signal.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDOUT</name>
            <description>Pin select for SDOUT signal.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
